List<Map<String, dynamic>> praise = [
{
  'title' : "سُبْحَانَ اللَّهِ",
  'subTitle' : "كتب له ألف حسنة أو يحط عنه ألف خطيئة"
},
{
  'title' : "سُبْحَانَ اللَّهِ وَبِحَمْدِهِ",
  'subTitle' : "حُطَّتْ خَطَايَاهُ وَإِنْ كَانَتْ مِثْلَ زَبَدِ الْبَحْرِ. لَمْ يَأْتِ أَحَدٌ يَوْمَ الْقِيَامَةِ بِأَفْضَلَ مِمَّا جَاءَ بِهِ إِلَّا أَحَدٌ قَالَ مِثْلَ مَا قَالَ أَوْ زَادَ عَلَيْهِ"
},
{
  'title' : "سُبْحَانَ اللَّهِ وَالْحَمْدُ لِلَّهِ",
  'subTitle' : "تَمْلَآَنِ مَا بَيْنَ السَّمَاوَاتِ وَالْأَرْضِ"
},
{
  'title' : "سُبْحَانَ اللهِ العَظِيمِ وَبِحَمْدِهِ",
  'subTitle' : "غرست له نخلة في الجنة (أى عدد)"
},
{
  'title' : "سُبْحَانَ اللَّهِ وَبِحَمْدِهِ ، سُبْحَانَ اللَّهِ الْعَظِيمِ",
  'subTitle' : "ثقيلتان في الميزان حبيبتان إلى الرحمن (أى عدد)"
},
{
  'title' : "لَا إلَه إلّا اللهُ وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلُّ شَيْءِ قَدِيرِ",
  'subTitle' : "كانت له عدل عشر رقاب، وكتبت له مئة حسنة، ومحيت عنه مئة سيئة، وكانت له حرزا من الشيطان"
},
{
  'title' : "لا حَوْلَ وَلا قُوَّةَ إِلا بِاللَّ",
  'subTitle' : "كنز من كنوز الجنة (أى عدد)"
},
{
  'title' : "الْحَمْدُ للّهِ رَبِّ الْعَالَمِينَ",
  'subTitle' : "تملأ ميزان العبد بالحسنات"
},
{
  'title' : "الْلَّهُم صَلِّ وَسَلِم وَبَارِك عَلَى سَيِّدِنَا مُحَمَّد",
  'subTitle' : "من صلى على حين يصبح وحين يمسى ادركته شفاعتى يوم القيامة"
},
{
  'title' : "أستغفر الله",
  'subTitle' : "لفعل الرسول صلى الله عليه وسلم"
},
{
  'title' : "سُبْحَانَ الْلَّهِ، وَالْحَمْدُ لِلَّهِ، وَلَا إِلَهَ إِلَّا الْلَّهُ، وَالْلَّهُ أَكْبَ",
  'subTitle' : "أنهن أحب الكلام الى الله، ومكفرات للذنوب، وغرس الجنة، وجنة لقائلهن من النار، وأحب الى النبي عليه السلام مما طلعت عليه الشمس، والْبَاقِيَاتُ الْصَّالِحَات"
},
{
  'title' : "لَا إِلَهَ إِلَّا اللَّهُ",
  'subTitle' : "أفضل الذكر لا إله إلاّ الله"
},
{
  'title' : "الْلَّهُ أَكْبَر",
  'subTitle' : "من قال الله أكبر كتبت له عشرون حسنة وحطت عنه عشرون سيئة"
},
{
  'title' : "سُبْحَانَ اللَّهِ ، وَالْحَمْدُ لِلَّهِ ، وَلا إِلَهَ إِلا اللَّهُ ، وَاللَّهُ أَكْبَرُ ، اللَّهُمَّ اغْفِرْ لِي ، اللَّهُمَّ ارْحَمْنِي ، اللَّهُمَّ ارْزُقْنِ",
  'subTitle' : "خير الدنيا والآخرة"
},
{
  'title' : "الْحَمْدُ لِلَّهِ حَمْدًا كَثِيرًا طَيِّبًا مُبَارَكًا فِيهِ",
  'subTitle' : "قَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ لقد رَأَيْتُ اثْنَيْ عَشَرَ مَلَكًا يَبْتَدِرُونَهَا، أَيُّهُمْ يَرْفَعُهَا"
},
{
  'title' : "اللَّهُ أَكْبَرُ كَبِيرًا ، وَالْحَمْدُ لِلَّهِ كَثِيرًا ، وَسُبْحَانَ اللَّهِ بُكْرَةً وَأَصِيلاً",
  'subTitle' : "قَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ عَجِبْتُ  لَهَا ، فُتِحَتْ لَهَا أَبْوَابُ السَّمَاءِ"
},
{
  'title' : "اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ وَعَلَى آلِ مُحَمَّدٍ كَمَا صَلَّيْتَ عَلَى إِبْرَاهِيمَ , وَعَلَى آلِ إِبْرَاهِيمَ إِنَّكَ حَمِيدٌ مَجِيدٌ , اللَّهُمَّ بَارِكْ عَلَى مُحَمَّدٍ وَعَلَى آلِ مُحَمَّدٍ كَمَا بَارَكْتَ عَلَى إِبْرَاهِيمَ وَعَلَى آلِ إِبْرَاهِيمَ إِنَّكَ حَمِيدٌ مَجِيدٌ",
  'subTitle' : "في كل مره تحط عنه عشر خطايا ويرفع له عشر درجات ويصلي الله عليه عشرا وتعرض على الرسول صلى الله عليه وسلم (أى عدد)"
},
];
